app/views/apartmenttypes/index.html.erb


        <% Apartmenttype.read.order("title desc").each do |apartmenttype| %>
---
SELECT "apartmenttypes".* FROM "apartmenttypes" ORDER BY title desc

       <ul>
      <li>McManus has <%= Apartmenttype.count %> apartment types.</li>
---
SELECT "apartmenttypes".* FROM "apartmenttypes" ORDER BY year desc LIMIT 1
SELECT COUNT(*) FROM "apartmenttypes"


<li>McManus has <%= Studentdirector.count %> student directors responsible for all the apartment types.</li>
---
SELECT "directors".* FROM "directors" ORDER BY "directors"."id" ASC LIMIT 1 OFFSET 0
SELECT "studentdirectors".* FROM "studentdirectors" ORDER BY "studentdirectors"."id" ASC LIMIT 1 OFFSET 1
SELECT COUNT(*) FROM "directors"
SELECT COUNT(*) FROM "studentdirectors"

        <% random_studentdirector = Studentdirector.sample %>
        <% number_of_apartmenttypes = Apartmenttype.where(:studentdirector_id => random_studentdirector["id"]).count %>
---
SELECT COUNT(*) FROM "apartmenttypes" WHERE "apartmenttypes"."studentdirector_id" = 8