app/views/apartmenttypes/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."apartmenttype_id" = 84
SELECT AVG("reviews"."rating") AS avg_id FROM "reviews" WHERE "reviews"."apartmenttype_id" = 84
---

              <% avg = Review.where("apartmenttype_id" => apartmenttype["id"]).average(:rating).to_i %>

SELECT "userpreferences".* FROM "userpreferences" WHERE "userpreferences"."apartmenttype_id" = 41
---

    <% userpreferences = Userpreference.where("apartmenttype_id" => apartmenttype["id"]) %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."apartmenttype_id" = 84
---

    <% if Review.where("apartmenttype_id" => apartmenttype["id"]).count == 0 %>