app/controllers/apartmenttypes_controller.rb

   def create
     Apartmenttype.create("title" => params["title"],
                  "rent" => params["rent"],
                  "poster_url" => params["url"],
                  "studentdirector_id" => params["chosen_studentdirector_id"])
---
INSERT INTO "apartmenttypes" ("poster_url", "rent", "studentdirector_id", "title") VALUES (?, ?, ?, ?)  [["poster_url", ""], ["rent", 3200], ["studentdirector_id", 8], ["title", "Parking"]]