app/controllers/reviews_controller.rb

   def create
     Review.create("apartmenttype_id" => params["apartmenttype_id"],
                   "rating" => params["rating"],
                   "content" => params["content"])
---
INSERT INTO "reviews" ("apartmenttype_id", "content", "created_at", "rating") VALUES (?, ?, ?, ?)  [["apartmenttype_id", 98], ["content", "Great apartment"], ["created_at", Fri, 30 May 2014 18:33:26 UTC +00:00], ["rating", 4]]