app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'deependraojha' LIMIT 1
---
   def authenticate
     the_user = User.find_by("username" => params["username"])